app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    if params[:sort] == "alphabetical"
      @products = Product.new.alphabetical
    else
      @products = Product.all